s3ptar/HomeServer/Firmware/Cypress/PSoC_Eve-master/PSoC_Eve-master/PSoC_Eve_Library/PSoCEve_List.h
/*******************************************************************************
*   EVE Chip Commands
*******************************************************************************/    
    
#define FT800_ACTIVE        0x00			// Initializes FT800
#define FT800_STANDBY	    0x41			// Place FT800 in Standby (clk running)
#define FT800_SLEEP		    0x42			// Place FT800 in Sleep (clk off)
#define FT800_PWRDOWN	    0x50			// Place FT800 in Power Down (core off)
#define FT800_CLKEXT	    0x44			// Select external clock source
#define FT800_CORERST	    0x68			// Reset core - all registers default  

#if defined EVE_FT800
    #define FT800_CLK36M	0x61			// Select 36MHz PLL
    #define FT800_CLK48M	0x62			// Select 48MHz PLL
#elif defined EVE_FT810    
    #define FT800_CLKINT	0x48			// Select internal clock source    
    #define FT800_PDROMS    0x49
    #define FT800_CLKSEL	0x62			// Select 48MHz PLL
    //#define FT800_CLKSEL	0x61			// Select 36MHz PLL
         
    #define FT800_PINDRIVE  0x70
    #define PIN_PD_STATE    0x71
#endif    
    
    // FT800 Memory Commands.
#define MEMORY_WRITE    0x800000	    // FT800 Host Memory Write 
#define MEMORY_READ		0x000000		// FT800 Host Memory Read    

/*******************************************************************************
*   Definition about swaping mode.
*******************************************************************************/
    
#define DLSWAP_LINE           1UL    
#define DLSWAP_FRAME          2UL    
    
/*******************************************************************************
*   Definition of contants for primitive type
*******************************************************************************/ 
    
#define PRIMITIVE_BITMAP        1
#define PRIMITIVE_POINT         2
#define PRIMITIVE_LINE          3
#define PRIMITIVE_LINE_STRIP    4
#define PRIMITIVE_EDGE_STRIP_R  5
#define PRIMITIVE_EDGE_STRIP_L  6
#define PRIMITIVE_EDGE_STRIP_A  7
#define PRIMITIVE_EDGE_STRIP_B  8
#define PRIMITIVE_RECTANGLE     9    
    
/*******************************************************************************
*   Definition of contants for the command BITMAP_LAYOUT
*******************************************************************************/     
    
#define BITMAP_LAYOUT_ARGB1555          0    
#define BITMAP_LAYOUT_L1                1
#define BITMAP_LAYOUT_L4                2
#define BITMAP_LAYOUT_L8                3
#define BITMAP_LAYOUT_RGB332            4
#define BITMAP_LAYOUT_ARGB2             5
#define BITMAP_LAYOUT_ARGB4             6
#define BITMAP_LAYOUT_RGB565            7 
#define BITMAP_LAYOUT_TEXT8X8           9
#define BITMAP_LAYOUT_TEXTVGA           10
#define BITMAP_LAYOUT_BARGRAPH          11    

#if defined EVE_FT800
    #define BITMAP_LAYOUT_PALETTED      8
#elif defined EVE_FT810
    #define BITMAP_LAYOUT_PALETTED565   14
    #define BITMAP_LAYOUT_PALETTED4444  15
    #define BITMAP_LAYOUT_PALETTED8     16
    #define BITMAP_LAYOUT_L2            17
#endif    
    
/*******************************************************************************
*   Definition of contants for the command BITMAP_SIZE
*******************************************************************************/ 
    
#define BITMAP_SIZE_FILTER_NEAREST      0 
#define BITMAP_SIZE_FILTER_BILINEAR     1 
#define BITMAP_SIZE_WRAP_BORDER         0
#define BITMAP_SIZE_WRAP_REPEAT         1    
    
/*******************************************************************************
*   Definition of contants for the command ALPHA_FUNC
*******************************************************************************/
    
#define ALPHA_FUNC_NEVER        0
#define ALPHA_FUNC_LESS         1
#define ALPHA_FUNC_LEQUAL       2
#define ALPHA_FUNC_GREATER      3
#define ALPHA_FUNC_GEQUAL       4
#define ALPHA_FUNC_EQUAL        5
#define ALPHA_FUNC_NOTEQUAL     6
#define ALPHA_FUNC_ALLWAYS      7     
    
/*******************************************************************************
*   Definition of contants for the command STENCIL_FUNC
*******************************************************************************/  
    
#define STENCIL_FUNC_NEVER      0
#define STENCIL_FUNC_LESS       1
#define STENCIL_FUNC_LEQUAL     2
#define STENCIL_FUNC_GREATER    3
#define STENCIL_FUNC_GEQUAL     4
#define STENCIL_FUNC_EQUAL      5
#define STENCIL_FUNC_NOTEQUAL   6
#define STENCIL_FUNC_ALLWAYS    7   

/*******************************************************************************
*   Definition of contants for the SCISSOR SIZE
*******************************************************************************/  
    
#if defined EVE_FT800
    #define SCISSOR_RESTORE_SIZE    512
#endif    
    
#if defined EVE_FT810
    #define SCISSOR_RESTORE_SIZE    2048
#endif    
 
    
/*******************************************************************************
*   Definition of contants for the command BLEND_FUNC
*******************************************************************************/  
    
#define BLEND_FUNC_ZERO                  0
#define BLEND_FUNC_ONE                   1
#define BLEND_FUNC_SRC_ALPHA             2
#define BLEND_FUNC_DST_ALPHA             3
#define BLEND_FUNC_ONE_MINUS_SRC_ALPHA   4  
#define BLEND_FUNC_ONE_MINUS_DST_ALPHA   5    
    
/*******************************************************************************
*   Definition of contants for the command STENCIL_OP
*******************************************************************************/  
  
#define STENCIL_OP_ZERO         0    
#define STENCIL_OP_KEEP         1
#define STENCIL_OP_REPLACE      2
#define STENCIL_OP_INCR         3
#define STENCIL_OP_DECR         4
#define STENCIL_OP_INVERT       5
    
/*******************************************************************************
*   Definition of clear constants
*******************************************************************************/

#define CLEAR_TAG           0x01
#define CLEAR_STENCIL       0x02
#define CLEAR_COLOR         0x04    
    
