s3ptar/HomeServer/Firmware/Cypress/PSoC_Eve-master/PSoC_Eve-master/PSoC_Eve_Library/PSoCEve_List.h
/*******************************************************************************
*   EVE Display List Commands & related macros.
*    
*   Every DL (display list) commmand is implemented as a function like macro. 
*   For a description of parameters for every command read related comments.
*   Every macro is a wrapper to a display list commands, so to know what every
*   display command does read the FT Programmers Guide from FTDI.    
*******************************************************************************/    
    
/* ************************************************************************** */   
#define DL_DISPLAY          	0x00000000  

/* ************************************************************************** */   
#define DL_BITMAP_SOURCE    	0x01000000 
#define _DLBitmapSource(address) (DL_BITMAP_SOURCE | address)   
    
void DLBitmapSource(uint32 address);

/* ************************************************************************** */  
#define DL_CLEAR_COLOR_RGB    	0x02000000
#define _DLClearColorRGB(red, green, blue) (DL_CLEAR_COLOR_RGB | (red << 16) | (green << 8) | blue)
    
void DLClearColorRGB(uint8 red, uint8 green, uint8 blue);    
/* ************************************************************************** */  
#define DL_TAG             		0x03000000
#define _DLTag(s) (DL_TAG | s)    

void DLTag(uint8 tag);
/* ************************************************************************** */ 
#define DL_COLOR_RGB        	0x04000000 
#define _DLColorRGB(red, green, blue) (DL_COLOR_RGB | (red << 16) | (green << 8) | blue)    

void DLColorRGB(uint8 red, uint8 green, uint8 blue);
/* ************************************************************************** */  
#define DL_BITMAP_HANDLE    	0x05000000
#define _DLBitmapHandle(handle) (DL_BITMAP_HANDLE | handle)  

void DLBitmapHandle(uint8 handle);
/* ************************************************************************** */      
#define DL_CELL             	0x06000000
#define _DLCell(cell) (DL_CELL | cell)    

void DLCell(uint8 cell);
/* ************************************************************************** */  
#define DL_BITMAP_LAYOUT    	0x07000000
#define _DLBitmapLayout(format, linestride, height) (DL_BITMAP_LAYOUT | ((format & 0x1F) << 19) | ((linestride & 0x03FF) << 9) | (height & 0x01FF))    
    
void DLBitmapLayout(uint8 format, uint16 linestride, uint16 height);
/* ************************************************************************** */        
#define DL_BITMAP_SIZE      	0x08000000
#define _DLBitmapSize(filter, wrapx, wrapy, width, height) (DL_BITMAP_SIZE | ((filter & 0x01) << 20) | ((wrapx & 0x01) << 19) | ((wrapy & 0x01) << 18) | ((width & 0x01FF) << 9) | (height & 0x01FF))    

void DLBitmapSize(uint8 filter, uint8 wrapx, uint8 wrapy, uint16 width, uint16 height);
/* ************************************************************************** */       
#define DL_ALPHA_FUNC       	0x09000000
#define _DLAlphaFunc(func, ref) (DL_ALPHA_FUNC | (func << 8) | ref)    

void DLAlphaFunc(uint8 func, uint8 ref);
/* ************************************************************************** */      
#define DL_STENCIL_FUNC     	0x0A000000
#define _DLStencilFunc(func, ref, mask) (DL_STENCIL_FUNC | (func << 16) | (ref << 8) | mask) 

void DLStencilFunc(uint8 func, uint8 ref, uint8 mask);
/* ************************************************************************** */ 
#define DL_BLEND_FUNC       	0x0B000000
#define _DLBlendFunc(src, dst) (DL_BLEND_FUNC | (src << 3) | dst)  

void DLBlendFunc(uint8 src, uint8 dst);
/* ************************************************************************** */     
#define DL_STENCIL_OP       	0x0C000000
#define _DLStencilOp(sfail, spass) (DL_STENCIL_OP | (sfail << 3) | spass)   

void DLStencilOp(uint8 sfail, uint8 spass);
/* ************************************************************************** */ 
#define DL_POINT_SIZE       	0x0D000000
#define _DLPointSize(size) (DL_POINT_SIZE | size)  

void DLPointSize(uint32 size);
/* ************************************************************************** */  
#define DL_LINE_WIDTH       	0x0E000000
#define _DLLineWidth(width) (DL_LINE_WIDTH | width)

void DLLineWidth(uint16 width);
/* ************************************************************************** */  
#define DL_COLOR_A          	0x10000000 
#define _DLColorA(alpha) (DL_COLOR_A | alpha)

void DLColorA(uint8 alpha);
/* ************************************************************************** */     
#define DL_CLEAR_STENCIL    	0x11000000
#define _DLClearStencil(s) (DL_CLEAR_STENCIL | s)  

void DLClearStencil(uint8 s);
/* ************************************************************************** */     
#define DL_CLEAR_TAG        	0x12000000
#define _DLClearTag(t) (DL_CLEAR_TAG | t)    

void DLClearTag(uint8 t);
/* ************************************************************************** */     
#define DL_STENCIL_MASK     	0x13000000
#define _DLStencilMask(mask) (DL_STENCIL_MASK | mask)   

void DLStencilMask(uint8 mask);
/* ************************************************************************** */     
#define DL_TAG_MASK         	0x14000000
#define _DLTagMask(mask) (DL_TAG_MASK | mask) 

void DLTagMask(uint8 mask);
/* ************************************************************************** */     
#define DL_BITMAP_TFORM_A   	0x15000000
#define _DLBitmapTransformA(a) (DL_BITMAP_TFORM_A | a)    

void DLBitmapTransformA(uint32 a);
/* ************************************************************************** */   
#define DL_BITMAP_TFORM_B   	0x16000000
#define _DLBitmapTransformB(b) (DL_BITMAP_TFORM_B | b)  

void DLBitmapTransformB(uint32 b);
/* ************************************************************************** */   
#define DL_BITMAP_TFORM_C   	0x17000000
#define _DLBitmapTransformC(c) (DL_BITMAP_TFORM_C | c)    

void DLBitmapTransformC(uint32 c);
/* ************************************************************************** */  
#define DL_BITMAP_TFORM_D   	0x18000000
#define _DLBitmapTransformD(d) (DL_BITMAP_TFORM_D | d)    

void DLBitmapTransformD(uint32 d);
/* ************************************************************************** */   
#define DL_BITMAP_TFORM_E   	0x19000000
#define _DLBitmapTransformE(e) (DL_BITMAP_TFORM_E | e) 

void DLBitmapTransformE(uint32 e);
/* ************************************************************************** */   
#define DL_BITMAP_TFORM_F   	0x1A000000
#define _DLBitmapTransformF(f) (DL_BITMAP_TFORM_F | f) 

