s3ptar/HomeServer/Firmware/Cypress/PSoC_Eve-master/PSoC_Eve-master/PSoC_Eve_Library/PSoCEve_List.h
void DLBitmapTransformF(uint32 f);
/* ************************************************************************** */   
#define DL_SCISSOR_XY       	0x1B000000

#if defined EVE_FT800
    #define _DLScissorXY(x, y) (DL_SCISSOR_XY | (x << 9) | y) 
#elif defined EVE_FT810
    #define _DLScissorXY(x, y) (DL_SCISSOR_XY | (x << 11) | y)
#endif

void DLScissorXY(uint16 x, uint16 y);
/* ************************************************************************** */  
#define DL_SCISSOR_SIZE     	0x1C000000

#if defined EVE_FT800
    #define _DLScissorSize(width, height) (DL_SCISSOR_SIZE | (width << 10) | height)
#elif defined EVE_FT810
    #define _DLScissorSize(width, height) (DL_SCISSOR_SIZE | (width << 12) | height)
#endif    

void DLScissorSize(uint16 width, uint16 height);
/* ************************************************************************** */  
#define DL_JUMP             	0x1E000000
#define _DLJump(address) (DL_JUMP | address)    

void DLJump(uint16 address);
/* ************************************************************************** */      
#define DL_BEGIN            	0x1F000000
#define _DLBegin(primitive) (DL_BEGIN | primitive)   

void DLBegin(uint8 primitive);
/* ************************************************************************** */     
#define DL_CALL             	0x1D000000
#define _DLCall(address) (DL_CALL | address)    

void DLCall(uint16 address);
/* ************************************************************************** */     
#define DL_COLOR_MASK       	0x20000000
#define _DLColorMask(r, g, b, a) (DL_COLOR_MASK | (r << 3) | (g << 2) | (b << 1) | a)    

void DLColorMask(uint8 r, uint8 g, uint8 b, uint8 a);
/* ************************************************************************** */ 
#define DL_END              	0x21000000
#define _DLEnd() (DL_END)    

void DLEnd();
/* ************************************************************************** */
#define DL_SAVE_CONTEXT     	0x22000000
#define _DLSaveContext() (DL_SAVE_CONTEXT)    

void DLSaveContext();
/* ************************************************************************** */  
#define DL_RESTORE_CONTEXT  	0x23000000
#define _DLRestoreContext() (DL_RESTORE_CONTEXT)   

void DLRestoreContext();
/* ************************************************************************** */   
#define DL_RETURN           	0x24000000
#define _DLReturn() (DL_RETURN)    

void DLReturn();
/* ************************************************************************** */      
#define DL_MACRO            	0x25000000
#define _DLMacro(macro) (DL_MACRO | macro)   

void DLMacro(uint8 macro);
/* ************************************************************************** */    
#define DL_CLEAR            	0x26000000
#define _DLClear(color, stencil, tag) (DL_CLEAR | (color << 2) | (stencil << 1) | tag) 

void DLClear(uint8 color, uint8 stencil, uint8 tag);
/* ************************************************************************** */ 
#define DL_VERTEX2F         	0x40000000

#if defined EVE_FT800
    #define _DLVertex2F(x, y) (DL_VERTEX2F | ((x << (4 - vertexFormat)) << 15) | (y << (4 - vertexFormat)))  
#elif defined EVE_FT810
    #define _DLVertex2F(x, y) (DL_VERTEX2F | (x << 15) | y)    
#endif    

void DLVertex2F(int16 x, int16 y);
/* ************************************************************************** */     
#define DL_VERTEX2II        	0x80000000
#define _DLVertex2II(x, y, handle, cell) (DL_VERTEX2II | (x << 21) | (y << 12) | (handle << 7) | cell) 

void DLVertex2II(uint16 x, uint16 y, uint8 handle, uint8 cell);

/* ************************************************************************** */
/* ************************************************************************** */

/* ************************************************************************** */
    #define VERTEX_FORMAT_1         0
    #define VERTEX_FORMAT_1_2       1
    #define VERTEX_FORMAT_1_4       2
    #define VERTEX_FORMAT_1_8       3
    #define VERTEX_FORMAT_1_16      4
/* ************************************************************************** */    

void DLVertexFormat(uint8 format);
/* ************************************************************************** */

#if defined EVE_FT810

    #define DL_VERTEX_FORMAT        0x27000000
    #define _DLVertexFormat(format) (DL_VERTEX_FORMAT | (format & 0x00000003))
    /* ************************************************************************** */ 
    #define DL_BITMAP_LAYOUT_H    	0x28000000
    #define _DLBitmapLayout_H(linestride, height) (DL_BITMAP_LAYOUT_H | ((linestride & 0x0C00) >> 8) | ((height & 0x0600) >> 9)) 
    /* ************************************************************************** */
    #define DL_BITMAP_SIZE_H      	0x29000000
    #define _DLBitmapSize_H(width, height) (DL_BITMAP_SIZE_H | ((width & 0x0600) >> 7) | ((height & 0x0600) >> 9)) 
    /* ************************************************************************** */
    #define DL_PALETTE_SOURCE       0x2A000000
    #define _DLPaletteSource(address) (DL_PALETTE_SOURCE | (address & 0x003FFFFF))
    
    void DLPaletteSource(uint32 address);
    /* ************************************************************************** */
    #define DL_VERTEX_TRANSLATE_X   0x2B000000
    #define _DLVertexTranslateX(translation)  (DL_VERTEX_TRANSLATE_X | (translation & 0x0001FFFF))
    
    void DLVertexTranslateX(int32 translation);
    /* ************************************************************************** */
    #define DL_VERTEX_TRANSLATE_Y   0x2C000000
    #define _DLVertexTranslateY(translation)  (DL_VERTEX_TRANSLATE_Y | (translation & 0x0001FFFF))
    
    void DLVertexTranslateY(int32 translation);    
    /* ************************************************************************** */
    #define DL_NOP                  0x2D000000
    #define _DLNop() (DL_NOP)
    
    void DLNop();
    
#endif    

/*******************************************************************************
*   EVE Coproccesor List Commands & related macros.
*    
*   Every CMD (coproccesor list) commmand is implemented as a function like
*   macro. 
*   For a description of parameters for every command read related comments.
*   Every macro is a wrapper to a coproccesor list command, so to know what
*   every display command does read the FT Programmers Guide from FTDI.    
*******************************************************************************/   

