s3ptar/HomeServer/Firmware/Cypress/PSoC_Eve-master/PSoC_Eve-master/PSoC_Eve_Library/PSoCEve_List.h
/*******************************************************************************
*   Data types for data formating.
*******************************************************************************/

typedef struct { int32 Command; } CINT32;
typedef struct { int32 Command; int8 v1; } CINT32_INT8;
typedef struct { int32 Command; int8 v0; int8 v1; int8 v2; int8 v3; } CINT32_4INT8;
typedef struct { int32 Command; int32 v0; } CINT32_CINT32;
typedef struct { int32 Command; int32 v0; int32 v1; } CINT32_2CINT32;
typedef struct { int32 Command; int32 v0; int32 v1; int32 v2; } CINT32_3CINT32;
typedef struct { int32 Command; int16 v0; int16 v1; int8 v2; int8 v3; int8 v4; int8 v5; int16 v6; int16 v7; int8 v8; int8 v9; int8 v10; int8 v11; } CINT32_2INT16_4INT8_X2;
typedef struct { int32 Command; int16 v0; int16 v1; int16 v2; int16 v3; } CINT32_4INT16;
//typedef struct { int32 Command; int16 v0; int16 v1; int16 v2; int16 v3; int8 v4; int8 v5; } CINT32_4INT16_2INT8;
typedef struct { int32 Command; int16 v0; int16 v1; int16 v2; int16 v3; int32 v4; } CINT32_4INT16_CINT32;
typedef struct { int32 Command; int16 v0; int16 v1; int16 v2; int16 v3; int32 v4; int16 v5; } CINT32_4INT16_CINT32_INT16;
typedef struct { int32 Command; int16 v0; int16 v1; int16 v2; int16 v3; int16 v4; } CINT32_5INT16;
typedef struct { int32 Command; int16 v0; int16 v1; int16 v2; int16 v3; int16 v4; int16 v5; } CINT32_6INT16;
typedef struct { int32 Command; int16 v0; int16 v1; int16 v2; int16 v3; int16 v4; int16 v5; int16 v6; } CINT32_7INT16;
typedef struct { int32 Command; int16 v0; int16 v1; int16 v2; int16 v3; int16 v4; int16 v5; int16 v6; int16 v7; } CINT32_8INT16;
typedef struct { int32 Command; int16 v0; int16 v1; int16 v2; int16 v3; int16 v4; int16 v5; int16 v6; int16 v7; int16 v8; int16 v9; } CINT32_10INT16;




/*******************************************************************************
*   Option values for commands that use option parameter.
*******************************************************************************/

#define OPT_3D          0
#define OPT_RGB565      0
#define OPT_MONO        1
#define OPT_NODL        2
#define OPT_FLAT        256
#define OPT_SIGNED      256
#define OPT_CENTERX     512
#define OPT_CENTERY     1024
#define OPT_CENTER      1536
#define OPT_RIGHTX      2048
#define OPT_NOBACK      4096
#define OPT_NOTICKS     8192
#define OPT_NOHM        16384
#define OPT_NOPOINTER   16384
#define OPT_NOSECS      32768
#define OPT_NOHANDS     49152

/*******************************************************************************
*   EVE Coprocesor Commands & related macros.
*******************************************************************************/

/* ************************************************************************** */
#define CMD_DLSTART             0xffffff00
#define _CMDDLStart() ((uint8*)&(CINT32){CMD_DLSTART}), sizeof(CINT32), 0

void CMDDLStart();
/* ************************************************************************** */
#define CMD_SWAP                0xffffff01
#define _CMDSwap() ((uint8*)&(CINT32){CMD_SWAP}), sizeof(CINT32), 0   

void CMDSwap();
/* ************************************************************************** */
#define CMD_INTERRUPT           0xffffff02
#define _CMDInterrupt(milliseconds) \
    ((uint8*)&(CINT32_CINT32){CMD_INTERRUPT, milliseconds}), sizeof(CINT32_CINT32), 0

void CMDInterrupt(uint32 milliseconds);
/* ************************************************************************** */
#define CMD_BGCOLOR             0xffffff09
#define _CMDBgcolor(red, green, blue) \
    ((uint8*)&(CINT32_4INT8){CMD_BGCOLOR, blue, green, red, 0}), sizeof(CINT32_4INT8), 0

void CMDBgcolor(int8 red, int8 green, int8 blue);
/* ************************************************************************** */
#define CMD_FGCOLOR             0xffffff0a
#define _CMDFgcolor(red, green, blue) \
    ((uint8*)&(CINT32_4INT8){CMD_FGCOLOR, blue, green, red, 0}), sizeof(CINT32_4INT8), 0

void CMDFgcolor(int8 red, int8 green, int8 blue);
/* ************************************************************************** */
#define CMD_GRADIENT            0xffffff0b
#define _CMDGradient(x0, y0, red0, green0, blue0, x1, y1, red1, green1, blue1) \
    ((uint8*)&(CINT32_2INT16_4INT8_X2){CMD_GRADIENT, x0, y0, blue0, green0, red0, 0, x1, y1, blue1, green1, red1, 0}), sizeof(CINT32_2INT16_4INT8_X2), 0

void CMDGradient(int16 x0, int16 y0, int8 red0, int8 green0, int8 blue0, int16 x1, int16 y1, int8 red1, int8 green1, int8 blue1);
/* ************************************************************************** */
#define CMD_TEXT                0xffffff0c
#define _CMDTextNew(x, y, font, options, text) \
    ((uint8*)&(CINT32_4INT16){CMD_TEXT, x, y, font, options}), sizeof(CINT32_4INT16), (unsigned char*)text  

void CMDText(int16 x, int16 y, int16 font, int16 options, char* text);
/* ************************************************************************** */
#define CMD_BUTTON              0xffffff0d
#define _CMDButton(x, y, width, height, font, options, text) \
    ((uint8*)&(CINT32_6INT16){CMD_BUTTON, x, y, width, height, font, options}), sizeof(CINT32_6INT16), (unsigned char*)text  

void CMDButton(int16 x, int16 y, int16 width, int16 height, int16 font, int16 options, char* text);
/* ************************************************************************** */
#define CMD_KEYS                0xffffff0e
#define _CMDKeys(x, y, width, height, font, options, text) \
    ((uint8*)&(CINT32_6INT16){CMD_KEYS, x, y, width, height, font, options}), sizeof(CINT32_6INT16), (unsigned char*)text

void CMDKeys(int16 x, int16 y, int16 width, int16 height, int16 font, int16 options, char* text);
/* ************************************************************************** */
#define CMD_PROGRESS            0xffffff0f
#define _CMDProgressBar(x, y, width, height, options, value, range) \
    ((uint8*)&(CINT32_7INT16){CMD_PROGRESS, x, y, width, height, options, value, range}), sizeof(CINT32_7INT16), 0

void CMDProgressBar(int16 x, int16 y, int16 width, int16 height, int16 options, int16 value, int16 range);
/* ************************************************************************** */
#define CMD_SLIDER              0xffffff10
#define _CMDSlider(x, y, width, height, options, value, range) \
    ((uint8*)&(CINT32_7INT16){CMD_SLIDER, x, y, width, height, options, value, range}), sizeof(CINT32_7INT16), 0

void CMDSlider(int16 x, int16 y, int16 width, int16 height, int16 options, int16 value, int16 range);
/* ************************************************************************** */
#define CMD_SCROLLBAR           0xffffff11
#define _CMDScrollBar(x, y, width, height, options, value, size, range) \
    ((uint8*)&(CINT32_8INT16){CMD_SCROLLBAR, x, y, width, height, options, value, size, range}), sizeof(CINT32_8INT16), 0

void CMDScrollBar(int16 x, int16 y, int16 width, int16 height, int16 options, int16 value, int16 size, int16 range);
/* ************************************************************************** */
#define CMD_TOGGLE              0xffffff12

