s3ptar/HomeServer/Firmware/Cypress/PSoC_Eve-master/PSoC_Eve-master/PSoC_Eve_Library/PSoCEve_List.h
#define TOGGLE_STATE_OFF    0
#define TOGGLE_STATE_ON     65535

#define _CMDToggle(x, y, width, font, options, state, text) \
    ((uint8*)&(CINT32_6INT16){CMD_TOGGLE, x, y, width, font, options, state}), sizeof(CINT32_6INT16), (unsigned char*)text

void CMDToggle(int16 x, int16 y, int16 width, int16 font, int16 options, int16 state, char* text);
/* ************************************************************************** */
#define CMD_GAUGE               0xffffff13
#define _CMDGauge(x, y, radius, options, major, minor, value, range) \
    ((uint8*)&(CINT32_8INT16){CMD_GAUGE, x, y, radius, options, major, minor, value, range}), sizeof(CINT32_8INT16), 0

void CMDGauge(int16 x, int16 y, int16 radius, int16 options, int16 major, int16 minor, int16 value, int16 range);
/* ************************************************************************** */
#define CMD_CLOCK               0xffffff14
#define _CMDClock(x, y, radius, options, hours, minutes, seconds, milliseconds) \
    ((uint8*)&(CINT32_8INT16){CMD_CLOCK, x, y, radius, options, hours, minutes, seconds, milliseconds}), sizeof(CINT32_8INT16), 0

void CMDClock(int16 x, int16 y, int16 radius, int16 options, int16 hours, int16 minutes, int16 seconds, int16 milliseconds);
/* ************************************************************************** */
#define CMD_CALIBRATE           0xffffff15
#define _CMDCalibrate() ((uint8*)&(CINT32_INT8){CMD_CALIBRATE, 0}), sizeof(CINT32_INT8), 0

void CMDCalibrate();
/* ************************************************************************** */
#define CMD_SPINNER             0xffffff16

#define SPINNER_ROUND   0
#define SPINNER_LINEAR  1
#define SPINNER_CLOCK   2
#define SPINNER_ORBIT   3

#define _CMDSpinner(x, y, style, scale) \
    ((uint8*)&(CINT32_4INT16){CMD_SPINNER, x, y, style, scale}), sizeof(CINT32_4INT16), 0

void CMDSpinner(int16 x, int16 y, int16 style, int16 scale);
/* ************************************************************************** */
#define CMD_STOP                0xffffff17
#define _CMDStop() ((uint8*)&(CINT32){CMD_STOP}), sizeof(CINT32), 0

void CMDStop();
/* ************************************************************************** */
#define CMD_MEMCRC              0xffffff18
/* ************************************************************************** */
#define CMD_REGREAD             0xffffff19
/* ************************************************************************** */
#define CMD_MEMWRITE            0xffffff1a
#define _CMDMemWrite(ptr, size) \
    ((uint8*)&(CINT32_2CINT32){CMD_MEMWRITE, ptr, size}), sizeof(CINT32_2CINT32), 0

void CMDMemWrite(int32 ptr, int32 size);
/* ************************************************************************** */
#define CMD_MEMSET              0xffffff1b
#define _CMDMemSet(ptr, value, size) \
    ((uint8*)&(CINT32_3CINT32){CMD_MEMSET, ptr, value, size}), sizeof(CINT32_3CINT32), 0

void CMDMemSet(int32 ptr, int32 value, int32 size);
/* ************************************************************************** */
#define CMD_MEMZERO             0xffffff1c
#define _CMDMemZero(ptr, size) \
    ((uint8*)&(CINT32_2CINT32){CMD_MEMZERO, ptr, size}), sizeof(CINT32_2CINT32), 0

void CMDMemZero(int32 ptr, int32 size);
/* ************************************************************************** */
#define CMD_MEMCPY              0xffffff1d
#define _CMDMemCopy(dest, src, size) \
    ((uint8*)&(CINT32_3CINT32){CMD_MEMCPY, dest, src, size}), sizeof(CINT32_3CINT32), 0

void CMDMemCopy(int32 dest, int32 src, int32 size);
/* ************************************************************************** */
#define CMD_APPEND              0xffffff1e
#define _CMDAppend(ptr, size) \
    ((uint8*)&(CINT32_2CINT32){CMD_APPEND, ptr, size}), sizeof(CINT32_2CINT32), 0

void CMDAppend(int32 ptr, int32 size);
/* ************************************************************************** */
#define CMD_SNAPSHOT            0xffffff1f
#define _CMDSnapshot(ptr) \
    ((uint8*)&(CINT32_CINT32){CMD_SNAPSHOT, ptr}), sizeof(CMD_SNAPSHOT), 0

void CMDSnapshot(int32 ptr);
/* ************************************************************************** */
#define CMD_INFLATE             0xffffff22
#define _CMDInflate(ptr) \
    ((uint8*)&(CINT32_CINT32){CMD_INFLATE, ptr}), sizeof(CINT32_CINT32), 0

void CMDInflate(int32 ptr);
/* ************************************************************************** */
#define CMD_GETPTR              0xffffff23
#define _CMDGETPTR(dummy) \
    ((uint8*)&(CINT32_CINT32){CMD_GETPTR, dummy}), sizeof(CINT32_CINT32), 0

inline int32 CMDGetPtr();
/* ************************************************************************** */
#define CMD_LOADIMAGE           0xffffff24
#define _CMDLoadImage(ptr, options) \
    ((uint8*)&(CINT32_2CINT32){CMD_LOADIMAGE, ptr, options}), sizeof(CINT32_2CINT32), 0

void CMDLoadImage(int32 ptr, int32 options);
void CMDLoadImage_Data(uint8* data, uint32 datalength, uint8 isend);
/* ************************************************************************** */
#define CMD_GETPROPS            0xffffff25
#define _CMDGETPROPS(ptr, dummy_width, dummy_height) \
    ((uint8*)&(CINT32_3CINT32){CMD_GETPROPS, ptr, dummy_width, dummy_height}), sizeof(CINT32_3CINT32), 0

void CMDGetProps(int32 ptr, int32* width, int32* height);
/* ************************************************************************** */
#define CMD_LOADIDENTITY        0xffffff26
#define _CMDLoadIdentity() ((uint8*)&(CINT32){CMD_LOADIDENTITY}), sizeof(CINT32), 0

void CMDLoadIdentity();
/* ************************************************************************** */
#define CMD_TRANSLATE           0xffffff27
#define _CMDTranslate(tx, ty) \
    ((uint8*)&(CINT32_2CINT32){CMD_TRANSLATE, tx, ty}), sizeof(CINT32_2CINT32), 0

void CMDTranslate(int32 tx, int32 ty);
/* ************************************************************************** */
#define CMD_SCALE               0xffffff28
#define _CMDScale(x, y) \
    ((uint8*)&(CINT32_2CINT32){CMD_SCALE, (x), (y)}), sizeof(CINT32_2CINT32), 0

