s3ptar/HomeServer/Firmware/Cypress/PSoC_Eve-master/PSoC_Eve-master/PSoC_Eve_Library/PSoCEve_List.h
void CMDScale(int32 x, int32 y);
/* ************************************************************************** */
#define CMD_ROTATE              0xffffff29
#define _CMDRotate(angle) \
    ((uint8*)&(CINT32_CINT32){CMD_ROTATE, ((angle))}), sizeof(CINT32_CINT32), 0

void CMDRotate(int32 angle);
/* ************************************************************************** */
#define CMD_SETMATRIX           0xffffff2a
#define _CMDSetmatrix() ((uint8*)&(CINT32){CMD_SETMATRIX}), sizeof(CINT32), 0

void CMDSetmatrix();
/* ************************************************************************** */
#define CMD_SETFONT             0xffffff2b
#define _CMDSetfont(font, ptr) \
    ((uint8*)&(CINT32_2CINT32){CMD_SETFONT, font, ptr}), sizeof(CINT32_2CINT32), 0

void CMDSetfont(int32 font, int32 ptr);
/* ************************************************************************** */
#define CMD_TRACK               0xffffff2c
#define _CMDTrack(x, y, width, height, tag) \
    ((uint8*)&(CINT32_5INT16){CMD_TRACK, x, y, width, height, tag}), sizeof(CINT32_5INT16), 0

void CMDTrack(int16 x, int16 y, int16 width, int16 height, int16 tag);
/* ************************************************************************** */
#define CMD_DIAL                0xffffff2d
#define _CMDDial(x, y, radius, options, value) \
    ((uint8*)&(CINT32_5INT16){CMD_DIAL, x, y, radius, options, value}), sizeof(CINT32_5INT16), 0

void CMDDial(int16 x, int16 y, int16 radius, int16 options, int16 value);
/* ************************************************************************** */
#define CMD_NUMBER              0xffffff2e
#define _CMDNumber(x, y, font, options, number) \
    ((uint8*)&(CINT32_4INT16_CINT32){CMD_NUMBER, x, y, font, options, number}), sizeof(CINT32_4INT16_CINT32), 0

void CMDNumber(int16 x, int16 y, int16 font, int16 options, int32 number);
/* ************************************************************************** */
#define CMD_SCREENSAVER         0xffffff2f
#define _CMDScreenSaver() ((uint8*)&(CINT32){CMD_SCREENSAVER}), sizeof(CINT32), 0

void CMDScreenSaver();
/* ************************************************************************** */
#define CMD_SKETCH              0xffffff30
#define _CMDSketch(x, y, width, height, ptr, format) \
    ((uint8*)&(CINT32_4INT16_CINT32_INT16){CMD_SKETCH, x, y, width, height, ptr, format}), sizeof(CINT32_4INT16_CINT32_INT16), 0

void CMDSketch(int16 x, int16 y, int16 width, int16 height, int32 ptr, int16 format);
/* ************************************************************************** */
#define CMD_LOGO                0xffffff31
#define _CMDLogo() ((uint8*)&(CINT32){CMD_LOGO}), sizeof(CINT32), 0

void CMDLogo();
/* ************************************************************************** */
#define CMD_COLDSTART           0xffffff32
#define _CMDColdstart() ((uint8*)&(CINT32){CMD_COLDSTART}), sizeof(CINT32), 0 

void CMDColdstart();
/* ************************************************************************** */
#define CMD_GETMATRIX           0xffffff33
/* ************************************************************************** */
#define CMD_GRADCOLOR           0xffffff34
#define _CMDGradcolor(red, green, blue) \
    ((uint8*)&(CINT32_4INT8){CMD_GRADCOLOR, blue, green, red, 0}), sizeof(CINT32_4INT8), 0

void CMDGradcolor(int8 red, int8 green, int8 blue);


/* ************************************************************************** */
/* ************************************************************************** */

void CMDSetBitmap(int32 address, int16 format, int16 width, int16 height);
/* ************************************************************************** */

#if defined EVE_FT810

    #define NUMBER_BASE_BINARY      2
    #define NUMBER_BASE_OCTAL       8
    #define NUMBER_BASE_DECIMAL     10
    #define NUMBER_BASE_HEXADECIMAL 16
    
    /* ************************************************************************** */
    #define CMD_CSKETCH         0xFFFFFF35
    /* ************************************************************************** */
    #define CMD_SETROTATE       0xFFFFFF36
    #define _CMDSETROTATE(rotation) \
        ((uint8*)&(CINT32_CINT32){CMD_SETROTATE, rotation}), sizeof(CINT32_CINT32), 0
    
    void CMDSetRotate(int32 rotation);
    /* ************************************************************************** */
    #define CMD_SNAPSHOT2       0xFFFFFF37
    /* ************************************************************************** */
    #define CMD_SETBASE         0xFFFFFF38
    #define _CMDSETBASE(base) \
        ((uint8*)&(CINT32_CINT32){CMD_SETBASE, base}), sizeof(CINT32_CINT32), 0

    void CMDSetBase(int32 base);
    /* ************************************************************************** */
    #define CMD_MEDIAFIFO       0xFFFFFF39
    /* ************************************************************************** */
    #define CMD_PLAYVIDEO       0xFFFFFF3A
    /* ************************************************************************** */
    #define CMD_SETFONT2        0xFFFFFF3B
    #define _CMDSETFONT2(font, ptr, firstchar) \
        ((uint8*)&(CINT32_3CINT32){CMD_SETFONT2, font, ptr, firstchar}), sizeof(CINT32_3CINT32), 0 
    
    void CMDSetfont2(int32 font, int32 ptr, int32 firstchar);
    /* ************************************************************************** */
    #define CMD_SETSCRATCH      0xFFFFFF3C
    /* ************************************************************************** */
    #define CMD_ROMFONT         0xFFFFFF3F
    #define _CMDROMFONT(handle, font) \
        ((uint8*)&(CINT32_2CINT32){CMD_ROMFONT, handle, font}), sizeof(CINT32_2CINT32), 0

    void CMDRomfont(int32 font, int32 handle);
    /* ************************************************************************** */
    #define CMD_VIDEOSTART      0xFFFFFF40
    /* ************************************************************************** */
    #define CMD_VIDEOFRAME      0xFFFFFF41
    /* ************************************************************************** */
    #define CMD_SETBITMAP       0xFFFFFF43   
    #define _CMDSetBitmap(address, format, width, height) \
    ((uint8*)&(CINT32_5INT16){CMD_SETBITMAP, address, format, width, height, 0}), sizeof(CINT32_5INT16), 0
        //((uint8*)&(CINT32_4INT16_2INT8){CMD_SETBITMAP, address, format, width, height, 0, 0}), sizeof(CINT32_4INT16_2INT8), 0
    
    
    //void CMDSetBitmap(int32 address, int16 format, int16 width, int16 height);
    /* ************************************************************************** */
    
#endif    
    
