s3ptar/HomeServer/Firmware/Cypress/PSoC_Eve-master/PSoC_Eve-master/PSoC_Eve_Library/PSoCEve_List.h
/*******************************************************************************
*   Typedefs.
*******************************************************************************/

/* Typedef name : LISTTYPE.
   Description: To be used to know if there is a list in progress and wich type of
                list.
*/
typedef enum { NONE, DLIST, DATA } TRANSFERTYPE;

typedef enum { OK, UNKNOWN_LIST_TYPE, LIST_IN_PROGRESS, LIST_NOT_IN_PROGRESS } FTERROR;

/*******************************************************************************
*   Definition of constants for EVE_CoPro_EndDisplayList
*******************************************************************************/

typedef enum { END_DL_NOSWAP, END_DL_SWAP } SWAPACTION;
 

/*******************************************************************************
*   Variables.
*******************************************************************************/
    
extern uint16 ramCMDOffset;
 
/*******************************************************************************
*   Function prototypes.
*******************************************************************************/

uint8 FTIsCoproccesorReady();
uint16 FTGetCMDFifoFreeSpace();
void FT_Write_ByteArray_4(const uint8 *data, uint32 length);
FTERROR FT_ListStart(TRANSFERTYPE transfertype);
//FTERROR FT_ListStart(LISTTYPE listtype);
FTERROR FT_ListEnd(SWAPACTION swap);
//void DLListNewItem(uint32 item);
FTERROR FT_InflateFromFlash(const uint8 *flashptr, uint32 ramgptr, uint32 size);
FTERROR FT_InflateFromExternalFlash(uint32 flashptr, uint32 ramgptr, uint32 size);
FTERROR FT_LoadImageFromExternalFlash(uint32 flashptr, uint32 ramgptr, uint32 size, uint16 options);
FTERROR FT_TransferToRAMG(uint32 flashptr, uint32 size);    

#endif /* End PSOC_EVE_LIST_H */   

/* [] END OF FILE */
